{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.3.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 833], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 833], "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 4096, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of51.bin", "group1-shard2of51.bin", "group1-shard3of51.bin", "group1-shard4of51.bin", "group1-shard5of51.bin", "group1-shard6of51.bin", "group1-shard7of51.bin", "group1-shard8of51.bin", "group1-shard9of51.bin", "group1-shard10of51.bin", "group1-shard11of51.bin", "group1-shard12of51.bin", "group1-shard13of51.bin", "group1-shard14of51.bin", "group1-shard15of51.bin", "group1-shard16of51.bin", "group1-shard17of51.bin", "group1-shard18of51.bin", "group1-shard19of51.bin", "group1-shard20of51.bin", "group1-shard21of51.bin", "group1-shard22of51.bin", "group1-shard23of51.bin", "group1-shard24of51.bin", "group1-shard25of51.bin", "group1-shard26of51.bin", "group1-shard27of51.bin", "group1-shard28of51.bin", "group1-shard29of51.bin", "group1-shard30of51.bin", "group1-shard31of51.bin", "group1-shard32of51.bin", "group1-shard33of51.bin", "group1-shard34of51.bin", "group1-shard35of51.bin", "group1-shard36of51.bin", "group1-shard37of51.bin", "group1-shard38of51.bin", "group1-shard39of51.bin", "group1-shard40of51.bin", "group1-shard41of51.bin", "group1-shard42of51.bin", "group1-shard43of51.bin", "group1-shard44of51.bin", "group1-shard45of51.bin", "group1-shard46of51.bin", "group1-shard47of51.bin", "group1-shard48of51.bin", "group1-shard49of51.bin", "group1-shard50of51.bin", "group1-shard51of51.bin"], "weights": [{"name": "dense/kernel", "shape": [833, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 4096], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [4096], "dtype": "float32"}]}]}